Revit 2027 API
TaskDialog Constructor
 Creates a task dialog with title.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TaskDialog(
	string title
)
Public Sub New (
	title As String
)
public:
TaskDialog(
	String^ title
)
new :
        title : string -> TaskDialog
Parameters
title String
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when title is null.
ArgumentException |  Thrown when title is an empty string.
See Also
Reference
TaskDialog Class
Autodesk.Revit.UI Namespace